In [2]:
import csv
import pandas as pd

In [3]:
def most_successful(number, max_year, file_path):

SyntaxError: unexpected EOF while parsing (<ipython-input-3-8b5c26340aef>, line 1)

In [4]:
df = pd.read_csv("movies.csv", sep=',',  names=["Name", "Year", "Income"])

In [5]:
df.head()

  Ace Ventura: When Nature Calls  1995  108360000
0       The Hunt for Red October  1990  122012643
1           The Towering Inferno  1974  116000000
2          Rise of the Guardians  2012  103400692
3                Lethal Weapon 2  1989  147253986
4            The Bourne Identity  2002  121468960

In [21]:
max_year =  df['Year']<= 2002

In [25]:
max_year.head()
right_movies = df[max_year].sort_values(by=['Income'], ascending=False)
right_movies.head()

                                          Name  Year     Income
451                                    Titanic  1997  658672302
59   Star Wars: Episode I - The Phantom Menace  1999  474544677
478                                  Star Wars  1977  460935665
105                 E.T. the Extra-Terrestrial  1982  434949459
495                              The Lion King  1994  422783777

In [36]:
right_movies["Income"].max()

658672302

In [39]:
right_movies[0:3]

                                          Name  Year     Income
451                                    Titanic  1997  658672302
59   Star Wars: Episode I - The Phantom Menace  1999  474544677
478                                  Star Wars  1977  460935665

In [62]:
def most_successful(number, max_year, file_path):
    df = pd.read_csv(file_path,sep=',',  names=["Name", "Year", "Income"])
    limit_year =  df['Year']<= max_year
    right_movies = df[limit_year].sort_values(by=['Income'], ascending=False)
    answer = right_movies[0:number]
    #print(answer)
    count = 0
    for index, row in answer.iterrows():
        #print(row[0])
        #print(row[1])
        #print(row[2])
        count +=1
        print('The %s highest grossing movie until %s was %s (Year: %s) with an income of $ %d.' %(count,max_year,row[0],row[1],row[2]))
#execution

In [63]:
most_successful(3, 1975, 'movies.csv')

Jaws
1975
260000000
The 1 highest grossing movie until 1975 was Jaws (Year: 1975) with an income of $ 260000000.
The Exorcist
1973
204565000
The 2 highest grossing movie until 1975 was The Exorcist (Year: 1973) with an income of $ 204565000.
Gone with the Wind
1939
198655278
The 3 highest grossing movie until 1975 was Gone with the Wind (Year: 1939) with an income of $ 198655278.